#!/usr/bin/env python
# -*- coding: UTF-8 -*-
# Author: Wiliilm Fu

import os
import sys
China_Map = {
    "北京":{
	    "市辖区":(['东城区','西城区','崇文区','宣武区','朝阳区','丰台区','石景山区','海淀区',
                   '门头沟区','房山区','通州区','顺义区','昌平区','大兴区','怀柔区','平谷区']),
        "县":['密云县','延庆县']
},
    "上海":{
        "市辖区":(['黄浦区','卢湾区','徐汇区','长宁区','静安区','普陀区','闸北区','虹口区',
                  '杨浦区','闵行区','宝山区','嘉定区','浦东新区','金山区','松江区','青浦区','南汇区','奉贤区']),
        "县":['崇明县']
},
    "天津":{
        "市辖区":(['和平区','河东区','河西区','南开区','河北区','红桥区','塘沽区','汉沽区',
                   '大港区','东丽区','西青区','津南区','北辰区','武清区','宝坻区']),
        "县":['宁河县','静海县','蓟　县']
},
    "重庆":{
        "市辖区":(['万州区','涪陵区','渝中区','大渡口区','江北区','沙坪坝区','九龙坡区','南岸区',
                   '北碚区','万盛区','双桥区','渝北区','巴南区','黔江区','长寿区']),
        "县":(['綦江县','潼南县','铜梁县','大足县','荣昌县','璧山县','梁平县','城口县','丰都县',
              '垫江县','武隆县','忠　县','开　县','云阳县','奉节县','巫山县','巫溪县','石柱土家族自治县',
              '秀山土家族苗族自治县','酉阳土家族苗族自治县','彭水苗族土家族自治县']),
        "市":['江津市','合川市','永川市','南川市']
},
    "四川":{
        "成都市":(['市辖区','锦江区','青羊区','金牛区','武侯区','成华区','龙泉驿区','青白江区',
                  '新都区','温江县','金堂县','双流县','郫　县','大邑县','蒲江县','新津县',
                  '都江堰市','彭州市','邛崃市','崇州市']),
        "自贡市":['市辖区','自流井区','贡井区','大安区','沿滩区','荣　县','富顺县'],
        "攀枝花市":['市辖区','东　区','西　区','仁和区','米易县','盐边县'],
        "泸州市":['市辖区','江阳区','纳溪区','龙马潭区','泸　县','合江县','叙永县','古蔺县'],
        "德阳市":['市辖区','旌阳区','中江县','罗江县','广汉市','什邡市','绵竹市'],
        "绵阳市":(['市辖区','涪城区','游仙区','三台县','盐亭县','安　县','梓潼县','北川羌族自治县',
                   '平武县','江油市']),
        "广元市":['市辖区','市中区','元坝区','朝天区','旺苍县','青川县','剑阁县','苍溪县'],
        "遂宁市":['市辖区','船山区','安居区','蓬溪县','射洪县','大英县'],
        "内江市":['市辖区','市中区','东兴区','威远县','资中县','隆昌县'],
        "乐山市":(['市辖区','市中区','沙湾区','五通桥区','金口河区','犍为县','井研县','夹江县',
                  '沐川县','峨边彝族自治县','马边彝族自治县','峨眉山市']),
        "南充市":(['市辖区','顺庆区','高坪区','嘉陵区','南部县','营山县','蓬安县','仪陇县','西充县',
                  '阆中市']),
        "眉山市":['市辖区','东坡区','仁寿县','彭山县','洪雅县','丹棱县','青神县'],
        "宜宾市":(['市辖区','翠屏区','宜宾县','南溪县','江安县','长宁县','高　县','珙　县','筠连县',
                   '兴文县','屏山县']),
        "广安市":['市辖区','广安区','岳池县','武胜县','邻水县','华莹市'],
        "达州市":['市辖区','通川区','达　县','宣汉县','开江县','大竹县','渠　县','万源市'],
        "雅安市":['市辖区','雨城区','名山县','荥经县','汉源县','石棉县','天全县','芦山县','宝兴县'],
        "巴中市":['市辖区','巴州区','通江县','南江县','平昌县'],
        "资阳市":['市辖区','雁江区','安岳县','乐至县','简阳市'],
        "阿坝藏族羌族自治州":(['汶川县','理　县','茂　县','松潘县','九寨沟县','金川县','小金县','黑水县',
                               '马尔康县','壤塘县','阿坝县','若尔盖县','红原县']),
        "甘孜藏族自治州":(['康定县','泸定县','丹巴县','九龙县','雅江县','道孚县','炉霍县','甘孜县','新龙县',
                           '德格县','白玉县','石渠县','色达县','理塘县','巴塘县','乡城县','稻城县','得荣县']),
        "凉山彝族自治州":(['西昌市','木里藏族自治县','盐源县','德昌县','会理县','会东县','宁南县','普格县',
                           '布拖县','金阳县','昭觉县','喜德县','冕宁县','越西县','甘洛县','美姑县','雷波县'])
},
}

while True:
  for Province in China_Map: # 循环输出字典中的省
      print(Province)

  Province_Choice = input("请选择进入的省>>:")# 接收用户输入
  if Province_Choice in China_Map:# 判断用户输入的省名称是否存在于字典中
      while True:
          for City in China_Map[Province_Choice]:# 循环输出用户输入省名称下的城市
              print("\t",City)
          City_Choice = input("请选择进入的城市>>:")# 接收用户输入
          if City_Choice in China_Map[Province_Choice]:# 判断用户输入的城市名称是否存在于字典中
              while True:
                  for County in China_Map[Province_Choice][City_Choice]:# 循环输出用户输入城市名称下的市区
                      print("\t\t",County)
                  Last_Floor_Choice = input("已到达底部，按B/b返回:")
                  if Last_Floor_Choice == "B" or Last_Floor_Choice == "b":# 判断用户是否返回上一级
                      break
                  elif Last_Floor_Choice == "Q" or Last_Floor_Choice == "q":# 判断用户是否退出
                      sys.exit(0)
          if City_Choice == "B" or City_Choice == "b":# 判断用户是否返回上一级
              break
          elif City_Choice == "Q" or City_Choice == "q":# 判断用户是否退出
              sys.exit(0)
  elif Province_Choice == "Q" or Province_Choice == "q":# 判断用户是否退出
      sys.exit(0)